# קובץ config.py
# ריכוז כל ההגדרות הקבועות של האפליקציה במקום אחד

# ניקוד
WIN_POINTS = 3
TIE_POINTS = 1
LOSS_POINTS = 0

# הגדרת הטורנירים שלנו (לפי הקישור שיקבלו)
TOURNAMENTS = {
    "beit_el": "טורניר בית אל (בנימין)",
    "netafim": "טורניר נטפים (שומרון)"
}

# מילון אנשי צוות: 'שם_משתמש': 'סיסמה'
# ככה נדע בדיוק מי נכנס ומי עדכן נתונים
# STAFF_USERS = {
#     "eliran": "1234",
#     "אלירן" : "0508244707",
#     "עופר" : "0502222643",
#     "דידי" : "0525802704",
#     "דורון":"0502783969",
#     "חיים": "0546905230",

#     "moshe": "5555",
#     "david": "9876",
#     "admin": "0000"
# }
##לטורניר בנימין: http://localhost:8501/?tour=beit_el

##ללטורניר שומרון: http://localhost:8501/?tour=netafim

# מילון שחקנים: 'שם_השחקן': 'קוד_מדינה' (לפי תקן FlagCDN)
PLAYER_NICKNAMES_DICT = {
    "ליונל מסי": "ar",
    "כריסטיאנו רונאלדו": "pt",
    "קיליאן אמבפה": "fr",
    "ארלינג הולאנד": "no",
    "ויניסיוס ג׳וניור": "br",
    "לאמין ימאל": "es",
    "ג׳וד בלינגהאם": "gb-eng",
    "מוחמד סלאח": "eg",
    "לוקה מודריץ׳": "hr",
    "הארי קיין": "gb-eng",
    "ניימאר": "br",
    "רודריגו": "br",
    "פדרי": "es",
    "גאבי": "es",
    "ארדה גולר": "tr",
    "וירג׳יל ואן דייק": "nl",
    "קווין דה בריינה": "be",
    "טיבו קורטואה": "be",
    "אשרף חכימי": "ma",
    "לואיס דיאס": "co",
    "אלפונסו דייויס": "ca",
    "אנטואן גריזמן": "fr",
    "רוברט לבנדובסקי": "pl",
    "ג׳אנלואיג׳י דונארומה": "it",
    "לאוטרו מרטינס": "ar",
    "ג׳מאל מוסיאלה": "de",
    
    # ישראל
    "ירדן שועה": "il",
    "עומר אצילי": "il",
    "דור פרץ": "il",
    "ערן זהבי": "il",
    "רועי רביבו": "il",
    "דין דוד": "il",
    "גיא מלמד": "il",
    "דולב חזיזה": "il",
    "דור תורג׳מן": "il",
    "מנור סולומון": "il",
}

MAX_NICKNAME_REROLLS = 5

SETTLEMENTS = [
    "בית אל",
    "עפרה",
    "עלי",
    "שילה",
    "נווה צוף",
    "כוכב השחר",
    "אש קודש",
    "בני אדם",
    "יקיר",
    "נטפים",
    "איתמר",
    "אלון מורה",
    "יצהר",
    "תפוח",
    "עטרת",
    "רחלים",
    "חוות גלעד",
    "חוות יאיר",
    "גבעת הראל",
]

